Show / Hide Table of Contents
Class ConcreteCheckResultOverallItem
Overal check item
Inheritance
System.Object
ConcreteCheckResultOverallItem
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete.CheckResult
Assembly: IdeaRS.OpenModel.dll
Syntax
public class ConcreteCheckResultOverallItem
Constructors
Improve this Doc   View Source
ConcreteCheckResultOverallItem()
Constructor
Declaration
public ConcreteCheckResultOverallItem()
Properties
Improve this Doc   View Source
CheckValue
calculated limited value, calculated as strain to limit strain
Declaration
public double CheckValue { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Result
check result passed/failed
Declaration
public CheckResult Result { get; set; }
Property Value
 Type |  Description
 CheckResult
Improve this Doc   View Source
ResultType
Check result type
Declaration
public CheckResultType ResultType { get; set; }
Property Value
 Type |  Description
 CheckResultType
 Improve this Doc
 View Source